// 今盒子里有n个小球，A、B两人轮流从盒中取球，
// 每个人都可以看到另一个人取了多少个，也可以看到盒中还剩下多少个，
// 并且两人都很聪明，不会做出错误的判断。
// 我们约定：每个人从盒子中取出的球的数目必须是：1，3，7或者8个；
// 轮到某一方取球时不能弃权；
// A先取球，然后双方交替取球，直到取完；
// 被迫拿到最后一个球的一方为负方（输方）。
// 请编程确定出在双方都不判断失误的情况下，对于特定的初始球数，A是否能赢？
// 程序运行时，从标准输入获得数据，其格式如下：
// 先是一个整数n（n<100），表示接下来有n个整数；然后是n个整数，每个占一行（整数<10000），表示初始球数。
// 程序则输出n行，表示A的输赢情况（输为0，赢为1）。
// 例如，用户输入：
// 4
// 1
// 2
// 10
// 18
// 则程序应该输出：
// 0
// 1
// 1
// 0

#include<bits/stdc++.h>                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     
using namespace std;

int main(void) {
	vector<int> canWin = {1, 0, 1, 0, 1, 0, 1, 0, 1};    //某人面临下角标个球时能否赢 
	int n = 0;
	cin >> n;
	for (int i = 0; i < n; i++) {
		int num = 0;
		cin >> num;
		if (canWin.size() <= num) {
			for (int i = canWin.size(); i <= num; i++) {
				int can = ((canWin[i - 1] && canWin[i - 3] && canWin[i - 7] && canWin[i - 8]) ? 0 : 1);
				canWin.push_back(can);
			}
		}
		cout << canWin[num] << endl;		
	} 
	return 0;
} 
